Week 8/W8D1 - David Lai/reddit_clone/app/views/subs/show.html.erb

<% if @sub.posts %>
    <% @sub.posts.each do |post| %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."sub_id" = $1  [["sub_id", 1]]