Week 7/W7D2 - SOLO/music_app/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "RSMepditAFbGvMa6OhjczA"], ["updated_at", "2021-04-27 19:04:50.637661"], ["id", 1]]
---
    def reset_session_token!
        self.session_token = SecureRandom.urlsafe_base64
        self.save!

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "sjosiahleon@gmail.com"], ["LIMIT", 1]]
---
    def self.find_by_credentials(email, password)
        user = User.find_by(email: email)