Week 7/W7D2 - SOLO/music_app/app/views/bands/edit.html.erb


<%= render 'form', action: "PATCH", band: Band.find_by(id: params[:id]) %>
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]