Week 7/W7D2 - SOLO/music_app/app/views/bands/index.html.erb


<% bands = Band.all %>
---
SELECT "bands".* FROM "bands"

        <ul>
            <% albums = Album.where(band_id: band.id).pluck(:title) %>
---
SELECT "albums"."title" FROM "albums" WHERE "albums"."band_id" = $1  [["band_id", 1]]