Week 7/W7D2 - SOLO/music_app/app/views/bands/show.html.erb

<% band = Band.find_by(id: params[:id]) %>
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    <ul>
            <% albums = Album.where(band_id: band.id) %>
---
SELECT "albums".* FROM "albums" WHERE "albums"."band_id" = $1  [["band_id", 3]]