Week 7/W7D2 - SOLO/music_app/app/views/albums/_form.html.erb

        <select name="album[band_id]">
            <% Band.all.each do |band| %>
---
SELECT "bands".* FROM "bands"