Week 7/W7D2 - SOLO/music_app/app/views/albums/edit.html.erb

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
<h2>Make Your Changes Dude~</h2>
<% album = Album.find_by(id: params[:id]) %>