Week 7/W7D2 - SOLO/music_app/app/views/albums/show.html.erb

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---

<% album = Album.find_by(id: params[:id]) %>