Week 6/W6D5 - Elijah Ally/Clone99/app/models/cat_rental_request.rb

SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = $1  [["cat_id", 1]]
---
    def check_overlaps
        appoints = CatRentalRequest.where(cat_id: self.cat_id)
        all_requests = []
        appoints.each do |appt|