Week 7/W7D2 - SOLO/music_app/app/views/users/index.html.erb


<% users = User.all %>
---
SELECT "users".* FROM "users"