Week 7/W7D2 - SOLO/music_app/app/views/users/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
<h2>User Page</h2>
<% user = User.find_by(id: params[:id])  %>