Week 8/W8D1 - David Lai/reddit_clone/app/controllers/application_controller.rb

    def current_user
        @current_user ||= User.find_by(session_token: session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "60CBDquqa_lBIOmSRIkY-Q"], ["LIMIT", 1]]