Week 8/W8D1 - David Lai/reddit_clone/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "sub_id", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "my first post!!"], ["sub_id", 1], ["author_id", 1], ["created_at", "2021-05-03 19:17:51.419922"], ["updated_at", "2021-05-03 19:17:51.419922"]]
---
  def create
    @post = Post.new(post_params)
    @post.sub_id = params[:sub_id]
    if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @post = Post.find_by(id: params[:id])