Week 8/W8D1 - David Lai/reddit_clone/app/controllers/subs_controller.rb

SELECT "subs".* FROM "subs"
---
  def index
    @subs = Sub.all

INSERT INTO "subs" ("title", "description", "created_at", "updated_at", "moderator_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "hey its my first sub"], ["description", "my subbbb"], ["created_at", "2021-05-03 18:55:01.544014"], ["updated_at", "2021-05-03 18:55:01.544014"], ["moderator_id", 1]]
---
  def create
    @sub = Sub.new(sub_params)
    if @sub.save

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @sub = Sub.find_by(id: params[:id])