Week 8/W8D1 - David Lai/reddit_clone/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "session_token", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @user = User.find_by(id: params[:id])