Week 7/W7D2 - SOLO/music_app/app/controllers/albums_controller.rb

INSERT INTO "albums" ("title", "year", "band_id", "created_at", "updated_at", "live_or_studio") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Space Rock"], ["year", 1972], ["band_id", 1], ["created_at", "2021-04-27 23:23:56.497612"], ["updated_at", "2021-04-27 23:23:56.497612"], ["live_or_studio", "false"]]
---
    def create
        album = Album.new(album_params)
        if album.save

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "albums" WHERE "albums"."id" = $1  [["id", 2]]
---
    def destroy
        album = Album.find_by(id: params[:id])
        band_id = album.band_id
        if album.destroy