Week 7/W7D2 - SOLO/music_app/app/controllers/application_controller.rb

    def current_user
        return nil unless session[:session_token]
        @current_user ||= User.find_by(session_token: session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "NqKVmPQeCILxRHHt3uaTfw"], ["LIMIT", 1]]