Week 7/W7D2 - SOLO/music_app/app/controllers/bands_controller.rb

    def create
        band = Band.new(band_params)
        if band.save
---
INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Rock Smith & Sons"], ["created_at", "2021-04-27 21:07:06.383170"], ["updated_at", "2021-04-27 21:07:06.383170"]]

    def destroy
        band = Band.find_by(id: params[:id])
        if band.destroy
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 2]]

    def update
        band = Band.find_by(id: params[:id])
        if band.update(band_params)
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "mistakes were making2"], ["updated_at", "2021-04-27 21:35:03.777256"], ["id", 2]]