Week 6/W6D4 - Brenda Jiang/forgery_class/app/controllers/artworks_controller.rb

SELECT artworks.*, artwork_shares.* FROM "artworks" INNER JOIN "artwork_shares" ON "artwork_shares"."artwork_id" = "artworks"."id" INNER JOIN "users" ON "users"."id" = "artwork_shares"."viewer_id" WHERE "users"."id" = $1  [["id", "2"]]
---
    def index
        artworks = Artwork.left_outer_joins(:shared_viewers)
                            .where('users.id = ? OR artworks.artist_id = ?', params[:user_id], params[:user_id])
                            .select('artworks.*')