Week 6/W6D4 - Brenda Jiang/forgery_class/app/controllers/artwork_shares_controller.rb

    def create
        if ArtworkShare.new(share_params).save
---
INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 2], ["viewer_id", 3], ["created_at", "2021-04-22 21:08:58.550447"], ["updated_at", "2021-04-22 21:08:58.550447"]]

    def destroy
        art = ArtworkShare.find(params[:id])
        if art.destroy
---
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 2]]