Week 6/W6D4 - Brenda Jiang/forgery_class/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
    def index
        user = User.all

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Frank"], ["email", "frankgotthis@mail.com"], ["created_at", "2021-04-21 21:30:19.988583"], ["updated_at", "2021-04-21 21:30:19.988583"]]
---
    def create
        user = User.new(user_params)
        if user.save