Week 8/W8D1 - David Lai/reddit_clone/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "60CBDquqa_lBIOmSRIkY-Q"], ["updated_at", "2021-05-03 18:36:50.631180"], ["id", 1]]
---
    def reset_session_token!
        self.session_token = SecureRandom::urlsafe_base64
        self.save!