Week 6/W6D5 - Elijah Ally/Clone99/app/controllers/cats_controller.rb

    def index
        @cats = Cat.all
---
SELECT "cats".* FROM "cats"

    def show
        @cat = Cat.find_by(id: params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        @cat = Cat.new(cat_params)

        if @cat.save
---
INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def edit
        @cat = Cat.find_by(id: params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

    def update
        cat = Cat.find_by(id: params[:id])
        if cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "cats" SET "name" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["name", "Tmmy"], ["updated_at", "2021-04-23 22:27:27.682748"], ["id", 3]]